In [4]:
import pandas as pd
from matplotlib import pyplot as plt

import numpy as np

In [5]:
# Creating the dataframe  
df = pd.DataFrame({"A":[12, 4, 5, 44, 1], 
                   "B":[5, 2, 54, 3, 2],  
                   "C":[20, 16, 7, 3, 8], 
                   "D":[14, 3, 17, 2, 6]}) 
# Print the dataframe 
df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [6]:
df.mean()

A    13.2
B    13.2
C    10.8
D     8.4
dtype: float64

In [7]:
df.A.count()

5

In [8]:
df.A.mean()

13.2

In [9]:
df.A.std()

17.683325479106017

In [10]:
df.describe()

               A          B          C          D
count   5.000000   5.000000   5.000000   5.000000
mean   13.200000  13.200000  10.800000   8.400000
std    17.683325  22.840753   6.978539   6.730527
min     1.000000   2.000000   3.000000   2.000000
25%     4.000000   2.000000   7.000000   3.000000
50%     5.000000   3.000000   8.000000   6.000000
75%    12.000000   5.000000  16.000000  14.000000
max    44.000000  54.000000  20.000000  17.000000

In [11]:
df.A.describe()

count     5.000000
mean     13.200000
std      17.683325
min       1.000000
25%       4.000000
50%       5.000000
75%      12.000000
max      44.000000
Name: A, dtype: float64

In [12]:
df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [13]:
one=pd.DataFrame(np.random.randn(5,4))
one

          0         1         2         3
0  0.098744  0.088637  0.818592  0.115534
1 -1.042023 -0.178665 -0.053343  0.219534
2  1.008386 -0.384447 -1.594112 -0.153953
3  0.692132  0.382897  0.439928  0.920812
4  0.548290 -0.641748 -0.804874 -0.070568

In [14]:
two=pd.DataFrame(np.random.randn(5,4))
two

          0         1         2         3
0  0.551686  0.823937  0.956894 -0.766499
1 -0.008293  0.123115  0.569385 -0.019723
2 -0.479207 -0.004031 -1.716202 -0.446338
3  0.312290 -0.573140 -0.485557 -0.741950
4  0.212224 -0.582592  0.473045 -1.142754

In [24]:
pd.concat([one,two],ignore_index = True)

          0         1         2         3
0  0.098744  0.088637  0.818592  0.115534
1 -1.042023 -0.178665 -0.053343  0.219534
2  1.008386 -0.384447 -1.594112 -0.153953
3  0.692132  0.382897  0.439928  0.920812
4  0.548290 -0.641748 -0.804874 -0.070568
5  0.551686  0.823937  0.956894 -0.766499
6 -0.008293  0.123115  0.569385 -0.019723
7 -0.479207 -0.004031 -1.716202 -0.446338
8  0.312290 -0.573140 -0.485557 -0.741950
9  0.212224 -0.582592  0.473045 -1.142754

In [16]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import KFold
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier,export_graphviz
from sklearn import metrics